app/views/main/dashboard.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 33 LIMIT 1
---
          </td>
          <td><%= quality.user.last_name + ', ' + quality.user.first_name %></td>