app/views/quality/_form.html.erb

        <%= f.label :product_id %><br />
        <%= f.collection_select :product_id, Product.all, :id, :display_name, {:prompt => 'Select'}, {:style => 'width:300px;'} %>
---
SELECT "products".* FROM "products"

          <%= f.label :lab_method_id %><br />
          <%= f.collection_select :lab_method_id, LabMethod.all, :id, :display_name, {:prompt => 'Select'}, {:style => 'width:300px;'} %>
---
SELECT "lab_methods".* FROM "lab_methods"