app/views/quality/show.html.erb

        <div class="value">
          <div class="wrapper"><%= link_to(@quality.user.last_name + ", " + @quality.user.first_name, user_path(@quality.user)) %></div>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 33 LIMIT 1