app/controllers/main_controller.rb

  def dashboard
    @search = Quality.search(params[:search])
    @qualities = @search.page params[:page]

    if current_user.facility_id == 3
      @qualities_failed = Quality.where('last_disposition_state = ?','fail').where('facility_origin_id = ?','3').order("strftime('%Y',date) DESC, julian_date DESC, lot DESC, time DESC").limit(10).search(params[:search])
---
SELECT "qualities".* FROM "qualities" WHERE (last_disposition_state = 'fail') ORDER BY strftime('%Y',date) DESC, julian_date DESC, lot DESC, time DESC LIMIT 10
SELECT "qualities".* FROM "qualities" WHERE (last_disposition_state = 'fail') ORDER BY strftime('%Y',date) DESC, julian_date DESC, lot DESC, time DESC, "qualities"."date" DESC LIMIT 10