app/controllers/quality_controller.rb

SELECT "qualities".* FROM "qualities" WHERE "qualities"."id" = ? LIMIT 1  [["id", "4747"]]
INSERT INTO "quality_histories" ("action_type", "created_at", "quality_id", "skid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["action_type", "view"], ["created_at", Wed, 24 Apr 2013 21:05:07 UTC +00:00], ["quality_id", 4747], ["skid", nil], ["updated_at", Wed, 24 Apr 2013 21:05:07 UTC +00:00], ["user_id", 33]]
---
  def show
    @quality = Quality.find(params[:id])
    quality_history = QualityHistory.new({:user_id => current_user.id, :quality_id => @quality.id, :action_type => 'view'})
    quality_history.save

INSERT INTO "qualities" ("bulk_density", "coa_printed", "color_a", "color_b", "color_l", "created_at", "date", "facility_origin_id", "julian_date", "lab_method_id", "last_bulk_density_state", "last_bulk_density_value", "last_color_l_state", "last_color_l_value", "last_corrected_viscosity_value", "last_disposition_state", "last_moisture_state", "last_moisture_value", "last_viscosity_state", "last_viscosity_value", "lot", "moisture", "product_id", "skid", "solids", "starch_lot", "tank", "temperature", "time", "updated_at", "user_id", "viscosity") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @quality = Quality.new(params[:quality].merge(:facility_origin_id => current_user.facility_id))
    respond_to do |format|
      if @quality.save

SELECT "qualities".* FROM "qualities" WHERE "qualities"."id" = ? LIMIT 1  [["id", "4748"]]
DELETE FROM "qualities" WHERE "qualities"."id" = ?  [["id", 4748]]
---
  def destroy
    @quality = Quality.find(params[:id])
    @quality.destroy